n3rd-bugs/weird-rtos/port/target/stm32f407discovery/io/usb/usb_function_stm32f407.c
/*
 * usb_function_stm32f407.c
 *
 * Copyright (c) 2015 Usama Masood <mirzaon@gmail.com>
 *
 * Standard MIT License apply on this source code, with the inclusion of below
 * clause.
 *
 * This source is for educational purpose only, and should never be used for
 * any other purpose. If this source is used for other than educational purpose
 * (in any form) the author will not be liable for any legal charges.
 */
#include <os.h>
#include <string.h>

#ifdef USB_FUNCTION

/* Needs to be 32-bit aligned. */
USB_FUN_CDC_DEV USB_CDC_Device __attribute__ ((aligned (0x10)));

ISR_FUN usb_otg_interrupt()
{
    OS_ISR_ENTER();

    usb_function_stm32f407_interrupt_handler (&USB_CDC_Device.usb);

    OS_ISR_EXIT();
}

/*
 * usb_function_stm32f407_init
 * This function will initialize USB function device for STM32F407.
 */
void usb_function_stm32f407_init()
{
    memset(&USB_CDC_Device, 0, sizeof(USB_FUN_CDC_DEV));

    /* Initialize BSP. */
    usb_stm32f407_hw_initilaize((USB_STM32F407_HANDLE *)&USB_CDC_Device);

    /* Initialize USB function device. */
    usb_function_init((USB_STM32F407_HANDLE *)&USB_CDC_Device, &usb_fun_cdc_cb);

    /* Enable interrupts. */
    usb_stm32f407_enable_interrupt((USB_STM32F407_HANDLE *)&USB_CDC_Device);

    /* Initialize and register a console for this device. */
    /* For now we only support one CDC function console. */
    USB_CDC_Device.cdc_console.console.fs.name = "cdcf0";
    USB_CDC_Device.cdc_console.rx_pipe.fs.name = "cdcrx0";
    USB_CDC_Device.cdc_console.tx_pipe.fs.name = "cdctx0";
    usb_cdc_console_register(&USB_CDC_Device.cdc_console);

} /* usb_function_stm32f407_init */

/*
 * usb_function_stm32f407_init
 * @usb_device: USB device instance.
 * This function will initialize USB device registers for STM32F407.
 */
uint32_t usb_function_stm32f407_core_initialize_device(USB_STM32F407_HANDLE *usb_device)
{
    USB_STM32F407_DEPCTL    depctl;
    USB_STM32F407_DCFG      dcfg;
    USB_STM32F407_FSIZ      nptxfifosize;
    USB_STM32F407_FSIZ      txfifosize;
    USB_STM32F407_DIEPMSK   msk;
    USB_STM32F407_DTHRCTL   dthrctl;
    uint32_t i;

    depctl.d32 = 0;
    dcfg.d32 = 0;
    nptxfifosize.d32 = 0;
    txfifosize.d32 = 0;
    msk.d32 = 0;

    /* Restart the physical clock. */
    OS_WRITE_REG32(usb_device->regs.PCGCCTL, 0);

    /* Device configuration register. */
    dcfg.d32 = OS_READ_REG32( &usb_device->regs.DREGS->DCFG);
    dcfg.b.perfrint = DCFG_FRAME_INTERVAL_80;
    OS_WRITE_REG32( &usb_device->regs.DREGS->DCFG, dcfg.d32 );

#if defined(STM32F407_USB_FS_CORE)

    /* Initialize device speed. */
    usb_function_stm32f407_initialize_speed(usb_device , USB_STM32F407_SPEED_PARAM_FULL);

    /* Set RX FIFO size. */
    OS_WRITE_REG32(&usb_device->regs.GREGS->GRXFSIZ, RX_FIFO_FS_SIZE);

    /* Initialize EP0 in TX mode. */
    nptxfifosize.b.depth     = TX0_FIFO_FS_SIZE;
    nptxfifosize.b.startaddr = RX_FIFO_FS_SIZE;
    OS_WRITE_REG32( &usb_device->regs.GREGS->DIEPTXF0_HNPTXFSIZ, nptxfifosize.d32 );

    /* Initialize EP1 in TX mode. */
    txfifosize.b.startaddr = (uint16_t)(nptxfifosize.b.startaddr + nptxfifosize.b.depth);
    txfifosize.b.depth = TX1_FIFO_FS_SIZE;
    OS_WRITE_REG32( &usb_device->regs.GREGS->DIEPTXF[0], txfifosize.d32 );

    /* Initialize EP2 in TX mode. */
    txfifosize.b.startaddr = (uint16_t)(txfifosize.b.startaddr + txfifosize.b.depth);
    txfifosize.b.depth = TX2_FIFO_FS_SIZE;
    OS_WRITE_REG32( &usb_device->regs.GREGS->DIEPTXF[1], txfifosize.d32 );

    /* Initialize EP3 in TX mode. */
    txfifosize.b.startaddr = (uint16_t)(txfifosize.b.startaddr + txfifosize.b.depth);
    txfifosize.b.depth = TX3_FIFO_FS_SIZE;
    OS_WRITE_REG32( &usb_device->regs.GREGS->DIEPTXF[2], txfifosize.d32 );

#elif defined(STM32F407_USB_HS_CORE)

    /* Initialize device speed. */

    /* If we have ULPI physical. */
    if(usb_device->cfg.phy_itface  == STM32F407_USB_ULPI_PHY)
    {
        /* Initialize in HS mode. */
        usb_function_stm32f407_initialize_speed(usb_device , USB_STM32F407_SPEED_PARAM_HIGH);
    }
    else
    {
        /* Initialize in FS mode. */
        usb_function_stm32f407_initialize_speed(usb_device , USB_STM32F407_SPEED_PARAM_HIGH_IN_FULL);
    }

    /* Set RX FIFO size. */
    OS_WRITE_REG32(&usb_device->regs.GREGS->GRXFSIZ, RX_FIFO_HS_SIZE);

    /* Initialize EP0 in TX mode. */
    nptxfifosize.b.depth     = TX0_FIFO_HS_SIZE;
    nptxfifosize.b.startaddr = RX_FIFO_HS_SIZE;
    OS_WRITE_REG32( &usb_device->regs.GREGS->DIEPTXF0_HNPTXFSIZ, nptxfifosize.d32 );

    /* Initialize EP1 in TX mode. */
    txfifosize.b.startaddr = nptxfifosize.b.startaddr + nptxfifosize.b.depth;
    txfifosize.b.depth = TX1_FIFO_HS_SIZE;
    OS_WRITE_REG32( &usb_device->regs.GREGS->DIEPTXF[0], txfifosize.d32 );

    /* Initialize EP2 in TX mode. */
    txfifosize.b.startaddr += txfifosize.b.depth;
    txfifosize.b.depth = TX2_FIFO_HS_SIZE;
    OS_WRITE_REG32( &usb_device->regs.GREGS->DIEPTXF[1], txfifosize.d32 );

    /* Initialize EP3 in TX mode. */
    txfifosize.b.startaddr += txfifosize.b.depth;
    txfifosize.b.depth = TX3_FIFO_HS_SIZE;
    OS_WRITE_REG32( &usb_device->regs.GREGS->DIEPTXF[2], txfifosize.d32 );

    /* Initialize EP4 in TX mode. */
    txfifosize.b.startaddr += txfifosize.b.depth;
    txfifosize.b.depth = TX4_FIFO_HS_SIZE;
    OS_WRITE_REG32( &usb_device->regs.GREGS->DIEPTXF[3], txfifosize.d32 );

    /* Initialize EP5 in TX mode. */
    txfifosize.b.startaddr += txfifosize.b.depth;
    txfifosize.b.depth = TX5_FIFO_HS_SIZE;
    OS_WRITE_REG32( &usb_device->regs.GREGS->DIEPTXF[4], txfifosize.d32 );

#endif

    /* Flush the FIFOs. */
    usb_stm32f407_flush_tx_fifo(usb_device, 0x10);
    usb_stm32f407_flush_rx_fifo(usb_device);

    /* Clear all pending device interrupts. */
    OS_WRITE_REG32( &usb_device->regs.DREGS->DIEPMSK, 0 );
    OS_WRITE_REG32( &usb_device->regs.DREGS->DOEPMSK, 0 );
    OS_WRITE_REG32( &usb_device->regs.DREGS->DAINT, 0xFFFFFFFF );
    OS_WRITE_REG32( &usb_device->regs.DREGS->DAINTMSK, 0 );

    for (i = 0; i < usb_device->cfg.dev_endpoints; i++)
    {
        /* Initialize IN endpoints. */
        depctl.d32 = OS_READ_REG32(&usb_device->regs.INEP_REGS[i]->DIEPCTL);
        if (depctl.b.epena)
        {
            depctl.d32 = 0;
            depctl.b.epdis = 1;
            depctl.b.snak = 1;
        }
        else
        {
            depctl.d32 = 0;
        }

        OS_WRITE_REG32( &usb_device->regs.INEP_REGS[i]->DIEPCTL, depctl.d32);
        OS_WRITE_REG32( &usb_device->regs.INEP_REGS[i]->DIEPTSIZ, 0);
        OS_WRITE_REG32( &usb_device->regs.INEP_REGS[i]->DIEPINT, 0xFF);

        /* Initialize OUT endpoint. */
        depctl.d32 = OS_READ_REG32(&usb_device->regs.OUTEP_REGS[i]->DOEPCTL);
        if (depctl.b.epena)
        {
            depctl.d32 = 0;
            depctl.b.epdis = 1;
            depctl.b.snak = 1;
        }
        else
        {
            depctl.d32 = 0;
        }

        OS_WRITE_REG32( &usb_device->regs.OUTEP_REGS[i]->DOEPCTL, depctl.d32);
        OS_WRITE_REG32( &usb_device->regs.OUTEP_REGS[i]->DOEPTSIZ, 0);
        OS_WRITE_REG32( &usb_device->regs.OUTEP_REGS[i]->DOEPINT, 0xFF);
    }

    msk.d32 = 0;
    msk.b.txfifoundrn = 1;
    OS_MASK_REG32(&usb_device->regs.DREGS->DIEPMSK, msk.d32, msk.d32);

