n3rd-bugs/weird-rtos/port/target/stm32f407discovery/io/usb/usb_function_stm32f407.c
    if (usb_device->cfg.dma_enable == 1)
    {
        dthrctl.d32 = 0;
        dthrctl.b.non_iso_thr_en = 1;
        dthrctl.b.iso_thr_en = 1;
        dthrctl.b.tx_thr_len = 64;
        dthrctl.b.rx_thr_en = 1;
        dthrctl.b.rx_thr_len = 64;

        OS_WRITE_REG32(&usb_device->regs.DREGS->DTHRCTL, dthrctl.d32);
    }

    /* Enable USB interrupts. */
    usb_function_stm32f407_enable_interrupts(usb_device);

    /* Always return success. */
    return (SUCCESS);

} /* usb_function_stm32f407_core_initialize_device */

/*
 * usb_function_stm32f407_initialize_speed
 * @usb_device: USB device instance.
 * @speed: USB speed to be configured.
 * This function will return the current device speed.
 */
void usb_function_stm32f407_initialize_speed(USB_STM32F407_HANDLE *usb_device, uint8_t speed)
{
    USB_STM32F407_DCFG   dcfg;

    /* Read configuration. */
    dcfg.d32 = OS_READ_REG32(&usb_device->regs.DREGS->DCFG);

    /* Initialize configuration. */
    dcfg.b.devspd = speed & MASK_N_BITS(2);

    /* Update configuration. */
    OS_WRITE_REG32(&usb_device->regs.DREGS->DCFG, dcfg.d32);

} /* usb_function_stm32f407_initialize_speed */

/*
 * usb_function_stm32f407_get_device_speed
 * @usb_device: USB device instance.
 * This function will return the current device speed.
 */
enum USB_STM32F407_SPEED usb_function_stm32f407_get_device_speed(USB_STM32F407_HANDLE *usb_device)
{
    USB_STM32F407_DSTS  dsts;
    enum USB_STM32F407_SPEED speed = UNKNOWN;

    /* Get device status register. */
    dsts.d32 = OS_READ_REG32(&usb_device->regs.DREGS->DSTS);

    /* Calculate the device speed. */
    switch (dsts.b.enumspd)
    {
    case (DSTS_ENUMSPD_HS_PHY_30MHZ_OR_60MHZ):
        speed = HIGH;
        break;

    case (DSTS_ENUMSPD_FS_PHY_30MHZ_OR_60MHZ):
    case (DSTS_ENUMSPD_FS_PHY_48MHZ):
        speed = FULL;
        break;

    case (DSTS_ENUMSPD_LS_PHY_6MHZ):
        speed = LOW;
        break;
    }

    /* Return the device speed. */
    return (speed);

} /* usb_function_stm32f407_get_device_speed */

/*
 * usb_function_stm32f407_ep0_deactivate
 * @usb_device: USB device instance.
 * This function will activate the endpoint 0.
 */
uint32_t usb_function_stm32f407_ep0_deactivate(USB_STM32F407_HANDLE *usb_device)
{
    USB_STM32F407_DSTS      dsts;
    USB_STM32F407_DEPCTL    diepctl;
    USB_STM32F407_DCTL      dctl;

    dctl.d32 = 0;

    /* Read the device status and endpoint 0 control registers */
    dsts.d32 = OS_READ_REG32(&usb_device->regs.DREGS->DSTS);
    diepctl.d32 = OS_READ_REG32(&usb_device->regs.INEP_REGS[0]->DIEPCTL);

    /* Set the MPS of the IN endpoint based on the enumeration speed. */
    switch (dsts.b.enumspd)
    {
    case (DSTS_ENUMSPD_HS_PHY_30MHZ_OR_60MHZ):
    case (DSTS_ENUMSPD_FS_PHY_30MHZ_OR_60MHZ):
    case (DSTS_ENUMSPD_FS_PHY_48MHZ):
        diepctl.b.mps = DEP0CTL_MPS_64;
        break;
    case (DSTS_ENUMSPD_LS_PHY_6MHZ):
        diepctl.b.mps = DEP0CTL_MPS_8;
        break;
    }

    OS_WRITE_REG32(&usb_device->regs.INEP_REGS[0]->DIEPCTL, diepctl.d32);
    dctl.b.cgnpinnak = 1;
    OS_MASK_REG32(&usb_device->regs.DREGS->DCTL, dctl.d32, dctl.d32);

    /* Always return success. */
    return (SUCCESS);

} /* usb_function_stm32f407_ep0_deactivate */

/*
 * usb_function_stm32f407_ep_activate
 * @usb_device: USB device instance.
 * @ep: Endpoint to activate.
 * This function will activate an endpoint.
 */
uint32_t usb_function_stm32f407_ep_activate(USB_STM32F407_HANDLE *usb_device, USB_ENDPOINT *ep)
{
    USB_STM32F407_DEPCTL    depctl;
    USB_STM32F407_DAINT     daintmsk;
    volatile uint32_t       *addr;

    depctl.d32 = 0;
    daintmsk.d32 = 0;

    /* Read DEPCTL register. */
    if (ep->is_in == 1)
    {
        addr = &usb_device->regs.INEP_REGS[ep->num]->DIEPCTL;
        daintmsk.ep.in = (uint16_t)(1 << ep->num);
    }
    else
    {
        addr = &usb_device->regs.OUTEP_REGS[ep->num]->DOEPCTL;
        daintmsk.ep.out = (uint16_t)(1 << ep->num);
    }

    /* If the EP is already active don't change the EP control register. */
    depctl.d32 = OS_READ_REG32(addr);
    if (!depctl.b.usbactep)
    {
        depctl.b.mps        = ep->maxpacket & MASK_N_BITS(11);
        depctl.b.eptype     = ep->type & MASK_N_BITS(2);
        depctl.b.txfnum     = ep->tx_fifo_num & MASK_N_BITS(4);
        depctl.b.setd0pid   = 1;
        depctl.b.usbactep   = 1;
        OS_WRITE_REG32(addr, depctl.d32);
    }

    /* Enable the Interrupt for this EP */
#ifdef STM32F407_USB_HS_DEDICATED_EP1_ENABLED
    if((ep->num == 1)&&(usb_device->cfg.coreID == USB_OTG_HS_CORE_ID))
    {
        OS_MASK_REG32(&usb_device->regs.DREGS->DEACHMSK, 0, daintmsk.d32);
    }
    else
#endif
    {
        OS_MASK_REG32(&usb_device->regs.DREGS->DAINTMSK, 0, daintmsk.d32);
    }

    /* Always return success. */
    return (SUCCESS);

} /* usb_function_stm32f407_ep_activate */

/*
 * usb_function_stm32f407_ep_deactivate
 * @usb_device: USB device instance.
 * This function will return the current device speed.
 */
uint32_t usb_function_stm32f407_ep_deactivate(USB_STM32F407_HANDLE *usb_device , USB_ENDPOINT *ep)
{
    USB_STM32F407_DEPCTL  depctl;
    USB_STM32F407_DAINT  daintmsk;
    volatile uint32_t *addr;

    depctl.d32 = 0;
    daintmsk.d32 = 0;

    /* Read the DEPCTL register. */
    if (ep->is_in == 1)
    {
        addr = &usb_device->regs.INEP_REGS[ep->num]->DIEPCTL;
        daintmsk.ep.in = (uint16_t)(1 << ep->num);
    }
    else
    {
        addr = &usb_device->regs.OUTEP_REGS[ep->num]->DOEPCTL;
        daintmsk.ep.out = (uint16_t)(1 << ep->num);
    }

    depctl.b.usbactep = 0;
    OS_WRITE_REG32(addr, depctl.d32);

    /* Disable the interrupt for this EP. */
#ifdef STM32F407_USB_HS_DEDICATED_EP1_ENABLED
    if ((ep->num == 1) && (usb_device->cfg.coreID == USB_OTG_HS_CORE_ID))
    {
        OS_MASK_REG32(&usb_device->regs.DREGS->DEACHMSK, daintmsk.d32, 0);
    }
    else
#endif
    {
        OS_MASK_REG32(&usb_device->regs.DREGS->DAINTMSK, daintmsk.d32, 0);
    }

    /* Always return success. */
    return (SUCCESS);

} /* usb_function_stm32f407_ep_deactivate */

