n3rd-bugs/weird-rtos/port/target/stm32f407discovery/io/usb/usb_function_stm32f407.c
/*
 * usb_function_stm32f407_ep_start_transfer
 * @usb_device: USB device instance.
 * @ep: Endpoint to setup.
 * This function will setup an endpoint for transfer.
 */
uint32_t usb_function_stm32f407_ep_start_transfer(USB_STM32F407_HANDLE *usb_device, USB_ENDPOINT *ep)
{
    USB_STM32F407_DEPCTL        depctl;
    USB_STM32F407_DEPXFRSIZ     deptsiz;
    USB_STM32F407_DSTS          dsts;
    uint32_t fifoemptymsk = 0;

    depctl.d32 = 0;
    deptsiz.d32 = 0;

    /* If this is an IN endpoint. */
    if (ep->is_in == 1)
    {
        /* Read control and size registers. */
        depctl.d32  = OS_READ_REG32(&(usb_device->regs.INEP_REGS[ep->num]->DIEPCTL));
        deptsiz.d32 = OS_READ_REG32(&(usb_device->regs.INEP_REGS[ep->num]->DIEPTSIZ));

        /* If this is a zero length packet. */
        if (ep->xfer_len == 0)
        {
            deptsiz.b.xfersize = 0;
            deptsiz.b.pktcnt = 1;
        }
        else
        {
            /* Program the transfer size and packet count. */
            deptsiz.b.xfersize = ep->xfer_len & MASK_N_BITS(19);
            deptsiz.b.pktcnt = ((ep->xfer_len - 1 + ep->maxpacket) / ep->maxpacket) & MASK_N_BITS(10);

            if (ep->type == EP_TYPE_ISOC)
            {
                deptsiz.b.mc = 1;
            }
        }

        /* Write the EP size. */
        OS_WRITE_REG32(&usb_device->regs.INEP_REGS[ep->num]->DIEPTSIZ, deptsiz.d32);

        /* Setup endpoint interrupt. */
        if (usb_device->cfg.dma_enable == 1)
        {
            OS_WRITE_REG32(&usb_device->regs.INEP_REGS[ep->num]->DIEPDMA, ep->dma_addr);
        }
        else
        {
            if (ep->type != EP_TYPE_ISOC)
            {
                /* Enable the TX FIFO empty interrupt for this EP. */
                if (ep->xfer_len > 0)
                {
                    fifoemptymsk = (uint16_t)(1 << ep->num);
                    OS_MASK_REG32(&usb_device->regs.DREGS->DIEPEMPMSK, 0, fifoemptymsk);
                }
            }
        }

        /* If this is ISOC type endpoint. */
        if (ep->type == EP_TYPE_ISOC)
        {
            dsts.d32 = OS_READ_REG32(&usb_device->regs.DREGS->DSTS);

            if (((dsts.b.soffn) & 0x1) == 0)
            {
                depctl.b.setd1pid = 1;
            }
            else
            {
                depctl.b.setd0pid = 1;
            }
        }

        /* Enable endpoint and push data in the FIFO. */
        depctl.b.cnak = 1;
        depctl.b.epena = 1;
        OS_WRITE_REG32(&usb_device->regs.INEP_REGS[ep->num]->DIEPCTL, depctl.d32);

        if (ep->type == EP_TYPE_ISOC)
        {
            usb_stm32f407_write_packet(usb_device, ep->xfer_buff, ep->num, ep->xfer_len);
        }
    }
    else
    {
        /* This is a OUT endpoint. */
        /* Read control and size registers. */
        depctl.d32  = OS_READ_REG32(&(usb_device->regs.OUTEP_REGS[ep->num]->DOEPCTL));
        deptsiz.d32 = OS_READ_REG32(&(usb_device->regs.OUTEP_REGS[ep->num]->DOEPTSIZ));

        /* Program the transfer size and packet count. */
        if (ep->xfer_len == 0)
        {
            deptsiz.b.xfersize = ep->maxpacket & MASK_N_BITS(19);
            deptsiz.b.pktcnt = 1;
        }
        else
        {
            deptsiz.b.xfersize = (deptsiz.b.pktcnt * ep->maxpacket) & MASK_N_BITS(19) ;
            deptsiz.b.pktcnt = ((ep->xfer_len + (ep->maxpacket - 1)) / ep->maxpacket) & MASK_N_BITS(10);
        }

        /* Write the EP size. */
        OS_WRITE_REG32(&usb_device->regs.OUTEP_REGS[ep->num]->DOEPTSIZ, deptsiz.d32);

        if (usb_device->cfg.dma_enable == 1)
        {
            OS_WRITE_REG32(&usb_device->regs.OUTEP_REGS[ep->num]->DOEPDMA, ep->dma_addr);
        }

        /* If this is ISOC type endpoint. */
        if (ep->type == EP_TYPE_ISOC)
        {
            if (ep->even_odd_frame)
            {
                depctl.b.setd1pid = 1;
            }
            else
            {
                depctl.b.setd0pid = 1;
            }
        }

        /* Enable this endpoint. */
        depctl.b.cnak = 1;
        depctl.b.epena = 1;
        OS_WRITE_REG32(&usb_device->regs.OUTEP_REGS[ep->num]->DOEPCTL, depctl.d32);
    }

    /* Always return success. */
    return (SUCCESS);

} /* usb_function_stm32f407_ep_start_transfer */

/*
 * usb_function_stm32f407_ep_start_transfer
 * @usb_device: USB device instance.
 * @ep: Control endpoint.
 * This function will setup endpoint0 for transfer.
 */
uint32_t usb_function_stm32f407_ep0_start_transfer(USB_STM32F407_HANDLE *usb_device, USB_ENDPOINT *ep)
{
    USB_STM32F407_DEPCTL      depctl;
    USB_STM32F407_DEP0XFRSIZ  deptsiz;
    USB_STM32F407_INEPREGS    *in_regs;
    uint32_t fifoemptymsk = 0;

    depctl.d32   = 0;
    deptsiz.d32  = 0;

    /* If this is a IN endpoint. */
    if (ep->is_in == 1)
    {
        /* Get IN endpoint register. */
        in_regs = usb_device->regs.INEP_REGS[0];

        /* Get control and size registers. */
        depctl.d32  = OS_READ_REG32(&in_regs->DIEPCTL);
        deptsiz.d32 = OS_READ_REG32(&in_regs->DIEPTSIZ);

        /* If this is a zero length packet. */
        if (ep->xfer_len == 0)
        {
            deptsiz.b.xfersize = 0;
            deptsiz.b.pktcnt = 1;
        }
        else
        {
            /* Calculate the packet size and count. */
            if (ep->xfer_len > ep->maxpacket)
            {
                ep->xfer_len = ep->maxpacket;
                deptsiz.b.xfersize = ep->maxpacket & MASK_N_BITS(7);
                deptsiz.b.pktcnt = ((ep->xfer_len % ep->maxpacket) + 1) & MASK_N_BITS(2);
            }
            else
            {
                deptsiz.b.xfersize = ep->xfer_len & MASK_N_BITS(7);
                deptsiz.b.pktcnt = 1;
            }
        }

        /* Write the endpoint size. */
        OS_WRITE_REG32(&in_regs->DIEPTSIZ, deptsiz.d32);

        if (usb_device->cfg.dma_enable == 1)
        {
            OS_WRITE_REG32(&usb_device->regs.INEP_REGS[ep->num]->DIEPDMA, ep->dma_addr);
        }

        /* Enable endpoint and write data to be sent. */
        depctl.b.cnak = 1;
        depctl.b.epena = 1;
        OS_WRITE_REG32(&in_regs->DIEPCTL, depctl.d32);

        if (usb_device->cfg.dma_enable == 0)
        {
            /* Enable the Tx FIFO Empty Interrupt for this EP */
            if (ep->xfer_len > 0)
            {
                fifoemptymsk |= (uint32_t)(1 << ep->num);
                OS_MASK_REG32(&usb_device->regs.DREGS->DIEPEMPMSK, 0, fifoemptymsk);
            }
        }
    }
    else
    {
        /* If this is a OUT endpoint. */
        /* Read control and size registers. */
        depctl.d32  = OS_READ_REG32(&usb_device->regs.OUTEP_REGS[ep->num]->DOEPCTL);
        deptsiz.d32 = OS_READ_REG32(&usb_device->regs.OUTEP_REGS[ep->num]->DOEPTSIZ);

        /* Program the transfer size and packet. */
        if (ep->xfer_len == 0)
        {
            deptsiz.b.xfersize = ep->maxpacket & MASK_N_BITS(7);
            deptsiz.b.pktcnt = 1;
        }
        else
        {
            ep->xfer_len = ep->maxpacket;
            deptsiz.b.xfersize = ep->maxpacket & MASK_N_BITS(7);
            deptsiz.b.pktcnt = 1;
        }

        /* Write the endpoint size. */
        OS_WRITE_REG32(&usb_device->regs.OUTEP_REGS[ep->num]->DOEPTSIZ, deptsiz.d32);

