n3rd-bugs/weird-rtos/port/target/stm32f407discovery/io/usb/usb_function_stm32f407.c
        if (usb_device->cfg.dma_enable == 1)
        {
            OS_WRITE_REG32(&usb_device->regs.OUTEP_REGS[ep->num]->DOEPDMA, ep->dma_addr);
        }

        /* Enable this endpoint. */
        depctl.b.cnak = 1;
        depctl.b.epena = 1;
        OS_WRITE_REG32 (&(usb_device->regs.OUTEP_REGS[ep->num]->DOEPCTL), depctl.d32);

    }

    /* Always return success. */
    return (SUCCESS);

} /* usb_function_stm32f407_ep0_start_transfer */

/*
 * usb_function_stm32f407_ep_set_stall
 * @usb_device: USB function device instance.
 * @ep: Endpoint needed to be stalled.
 * This function will stall a given endpoint.
 */
uint32_t usb_function_stm32f407_ep_set_stall(USB_STM32F407_HANDLE *usb_device, USB_ENDPOINT *ep)
{
    USB_STM32F407_DEPCTL depctl;
    volatile uint32_t *depctl_addr;

    depctl.d32 = 0;

    /* If this is an IN endpoint. */
    if (ep->is_in == 1)
    {
        /* Read the endpoint configuration. */
        depctl_addr = &(usb_device->regs.INEP_REGS[ep->num]->DIEPCTL);
        depctl.d32 = OS_READ_REG32(depctl_addr);

        /* If this endpoint is enabled. */
        if (depctl.b.epena)
        {
            /* Disable this endpoint. */
            depctl.b.epdis = 1;
        }

        /* Set stall. */
        depctl.b.stall = 1;

        /* Update endpoint configuration. */
        OS_WRITE_REG32(depctl_addr, depctl.d32);
    }

    /* This is an OUT endpoint. */
    else
    {
        /* Read the endpoint configuration. */
        depctl_addr = &(usb_device->regs.OUTEP_REGS[ep->num]->DOEPCTL);
        depctl.d32 = OS_READ_REG32(depctl_addr);

        /* Set stall. */
        depctl.b.stall = 1;

        /* Update endpoint configuration. */
        OS_WRITE_REG32(depctl_addr, depctl.d32);
    }

    /* Always return success. */
    return (SUCCESS);

} /* usb_function_stm32f407_ep_set_stall */

/*
 * usb_function_stm32f407_ep_clear_stall
 * @usb_device: USB function device instance.
 * @ep: Endpoint for which stall needed to be cleared.
 * Clears stall for a given endpoint.
 */
uint32_t usb_function_stm32f407_ep_clear_stall(USB_STM32F407_HANDLE *usb_device, USB_ENDPOINT *ep)
{
    USB_STM32F407_DEPCTL  depctl;
    volatile uint32_t *depctl_addr;

    depctl.d32 = 0;

    /* Get the endpoint configuration. */
    if (ep->is_in == 1)
    {
        depctl_addr = &(usb_device->regs.INEP_REGS[ep->num]->DIEPCTL);
    }
    else
    {
        depctl_addr = &(usb_device->regs.OUTEP_REGS[ep->num]->DOEPCTL);
    }
    depctl.d32 = OS_READ_REG32(depctl_addr);

    /* Clear the stall for this endpoint. */
    depctl.b.stall = 0;

    /* If this is interrupt or bulk endpoint. */
    if ((ep->type == EP_TYPE_INTR) || (ep->type == EP_TYPE_BULK))
    {
        depctl.b.setd0pid = 1;
    }

    /* Update endpoint configuration. */
    OS_WRITE_REG32(depctl_addr, depctl.d32);

    /* Always return success. */
    return (SUCCESS);

} /* usb_function_stm32f407_ep_clear_stall */

/*
 * usb_function_stm32f407_stop_device
 * @usb_device: USB function device instance.
 * @ep: Endpoint for which status is needed.
 * Returns status for a given endpoint.
 */
uint32_t usb_function_stm32f407_ep_get_status(USB_STM32F407_HANDLE *usb_device, USB_ENDPOINT *ep)
{
    USB_STM32F407_DEPCTL depctl;
    volatile uint32_t *depctl_addr;
    uint32_t status = USB_STM32F407_EP_TX_DIS;

    depctl.d32 = 0;

    /* If this is an IN endpoint. */
    if (ep->is_in == 1)
    {
        /* Get endpoint configuration. */
        depctl_addr = &(usb_device->regs.INEP_REGS[ep->num]->DIEPCTL);
        depctl.d32 = OS_READ_REG32(depctl_addr);

        /* Get endpoint status. */
        if (depctl.b.stall == 1)
        {
            status = USB_STM32F407_EP_TX_STALL;
        }
        else if (depctl.b.naksts == 1)
        {
            status = USB_STM32F407_EP_TX_NAK;
        }
        else
        {
            status = USB_STM32F407_EP_TX_VALID;
        }
    }


    /* This is an OUT endpoint. */
    else
    {
        /* Get endpoint configuration. */
        depctl_addr = &(usb_device->regs.OUTEP_REGS[ep->num]->DOEPCTL);
        depctl.d32 = OS_READ_REG32(depctl_addr);

        /* Get endpoint status. */
        if (depctl.b.stall == 1)
        {
            status = USB_STM32F407_EP_RX_STALL;
        }
        else if (depctl.b.naksts == 1)
        {
            status = USB_STM32F407_EP_RX_NAK;
        }
        else
        {
            status = USB_STM32F407_EP_RX_VALID;
        }
    }

    /* Return endpoint status. */
    return (status);

} /* usb_function_stm32f407_ep_get_status */

/*
 * usb_function_stm32f407_ep_set_status
 * @usb_device: USB function device instance.
 * @ep: Endpoint for which status is needed to be updated.
 * Updates status for a given endpoint.
 */
void usb_function_stm32f407_ep_set_status(USB_STM32F407_HANDLE *usb_device, USB_ENDPOINT *ep, uint32_t status)
{
    USB_STM32F407_DEPCTL  depctl;
    volatile uint32_t *depctl_addr;

    depctl.d32 = 0;

    /* Process for IN endpoint */
    if (ep->is_in == 1)
    {
        /* Get endpoint configuration. */
        depctl_addr = &(usb_device->regs.INEP_REGS[ep->num]->DIEPCTL);
        depctl.d32 = OS_READ_REG32(depctl_addr);

        /* Configure endpoint status. */
        if (status == USB_STM32F407_EP_TX_STALL)
        {
            usb_function_stm32f407_ep_set_stall(usb_device, ep);
            return;
        }
        else if (status == USB_STM32F407_EP_TX_NAK)
        {
            depctl.b.snak = 1;
        }
        else if (status == USB_STM32F407_EP_TX_VALID)
        {
            /* If we are stalled. */
            if (depctl.b.stall == 1)
            {
                ep->even_odd_frame = 0;
                usb_function_stm32f407_ep_clear_stall(usb_device, ep);
                return;
            }

            depctl.b.cnak = 1;
            depctl.b.usbactep = 1;
            depctl.b.epena = 1;
        }
        else if (status == USB_STM32F407_EP_TX_DIS)
        {
            depctl.b.usbactep = 0;
        }
    }
    else /* Process for OUT endpoint */
    {
        /* Get endpoint configuration. */
        depctl_addr = &(usb_device->regs.OUTEP_REGS[ep->num]->DOEPCTL);
        depctl.d32 = OS_READ_REG32(depctl_addr);

        /* Configure endpoint status. */
        if (status == USB_STM32F407_EP_RX_STALL)
        {
            depctl.b.stall = 1;
        }
        else if (status == USB_STM32F407_EP_RX_NAK)
        {
            depctl.b.snak = 1;
        }
        else if (status == USB_STM32F407_EP_RX_VALID)
        {
            /* If we are stalled. */
            if (depctl.b.stall == 1)
            {
                ep->even_odd_frame = 0;
                usb_function_stm32f407_ep_clear_stall(usb_device, ep);
                return;
            }

            depctl.b.cnak = 1;
            depctl.b.usbactep = 1;
            depctl.b.epena = 1;
        }
        else if (status == USB_STM32F407_EP_RX_DIS)
        {
            depctl.b.usbactep = 0;
        }
    }

    /* Update endpoint status. */
    OS_WRITE_REG32(depctl_addr, depctl.d32);

} /* usb_function_stm32f407_ep_set_status */

