n3rd-bugs/weird-rtos/port/target/stm32f407discovery/io/usb/usb_function_stm32f407.c
/*
 * usb_function_stm32f407_ep_get_device_all_out_interrupt
 * @usb_device: USB function device instance.
 * Returns the all OUT endpoint interrupt status.
 */
uint32_t usb_function_stm32f407_ep_get_device_all_out_interrupt(USB_STM32F407_HANDLE *usb_device)
{
    uint32_t value;

    /* Read the interrupt status. */
    value  = OS_READ_REG32(&usb_device->regs.DREGS->DAINT);
    value &= OS_READ_REG32(&usb_device->regs.DREGS->DAINTMSK);

    /* Return all OUT endpoint(s) interrupt status. */
    return ((value & 0xffff0000) >> 16);

} /* usb_function_stm32f407_ep_get_device_all_out_interrupt */

/*
 * usb_function_stm32f407_ep_get_device_out_interrupt
 * @usb_device: USB function device instance.
 * Returns the OUT endpoint interrupt status.
 */
uint32_t usb_function_stm32f407_ep_get_device_out_interrupt(USB_STM32F407_HANDLE *usb_device , uint8_t epnum)
{
    uint32_t value;

    /* Read the interrupt status. */
    value  = OS_READ_REG32(&usb_device->regs.OUTEP_REGS[epnum]->DOEPINT);
    value &= OS_READ_REG32(&usb_device->regs.DREGS->DOEPMSK);

    /* Return OUT endpoint interrupt status. */
    return (value);

} /* usb_function_stm32f407_ep_get_device_out_interrupt */

/*
 * usb_function_stm32f407_ep_get_device_all_in_interrupt
 * @usb_device: USB function device instance.
 * Returns the all IN endpoint interrupt status.
 */
uint32_t usb_function_stm32f407_ep_get_device_all_in_interrupt(USB_STM32F407_HANDLE *usb_device)
{
    uint32_t value;

    /* Read the interrupt status. */
    value = OS_READ_REG32(&usb_device->regs.DREGS->DAINT);
    value &= OS_READ_REG32(&usb_device->regs.DREGS->DAINTMSK);

    /* Return all IN endpoint(s) interrupt status. */
    return (value & 0xffff);

} /* usb_function_stm32f407_ep_get_device_all_in_interrupt */

/*
 * usb_function_stm32f407_ep0_start_out
 * @usb_device: USB function device instance.
 * Setup control endpoint to receive setup packets.
 */
void usb_function_stm32f407_ep0_start_out(USB_STM32F407_HANDLE *usb_device)
{
    USB_STM32F407_DEP0XFRSIZ doeptsize0;

    /* Initialize size configuration. */
    doeptsize0.d32 = 0;
    doeptsize0.b.supcnt = 3;
    doeptsize0.b.pktcnt = 1;
    doeptsize0.b.xfersize = 8 * 3;
    OS_WRITE_REG32(&usb_device->regs.OUTEP_REGS[0]->DOEPTSIZ, doeptsize0.d32);

    /* If we are using DMA. */
    if (usb_device->cfg.dma_enable == 1)
    {
        USB_STM32F407_DEPCTL doepctl;

        doepctl.d32 = 0;
        OS_WRITE_REG32(&usb_device->regs.OUTEP_REGS[0]->DOEPDMA, (uint32_t)&usb_device->device.setup_packet);

        /* Enable this endpoint. */
        doepctl.d32 = OS_READ_REG32(&usb_device->regs.OUTEP_REGS[0]->DOEPCTL);
        doepctl.b.epena = 1;
        doepctl.d32 = 0x80008000;
        OS_WRITE_REG32( &usb_device->regs.OUTEP_REGS[0]->DOEPCTL, doepctl.d32);
    }

} /* usb_function_stm32f407_ep0_start_out */

/*
 * usb_function_stm32f407_activate_remote_wakeup
 * @usb_device: USB function device instance.
 * Activate remote wake up on USB device.
 */
void usb_function_stm32f407_activate_remote_wakeup(USB_STM32F407_HANDLE *usb_device)
{
    USB_STM32F407_DCTL      dctl;
    USB_STM32F407_DSTS      dsts;
    USB_STM32F407_PCGCCTL   power;

    /* If remote wake up is active. */
    if (usb_device->device.remote_wakeup)
    {
        /* Get device status. */
        dsts.d32 = OS_READ_REG32(&usb_device->regs.DREGS->DSTS);

        /* If we are suspended. */
        if(dsts.b.suspsts == 1)
        {
            /* If we are low power device. */
            if(usb_device->cfg.low_power)
            {
                /* Un-gate USB core clock. */
                power.d32 = OS_READ_REG32(&usb_device->regs.PCGCCTL);
                power.b.gatehclk = 0;
                power.b.stoppclk = 0;
                OS_WRITE_REG32(usb_device->regs.PCGCCTL, power.d32);
            }

            /* Activate remote wake up signaling. */
            dctl.d32 = 0;
            dctl.b.rmtwkupsig = 1;
            OS_MASK_REG32(&usb_device->regs.DREGS->DCTL, 0, dctl.d32);

            sleep(10);

            OS_MASK_REG32(&usb_device->regs.DREGS->DCTL, dctl.d32, 0);
        }
    }

} /* usb_function_stm32f407_activate_remote_wakeup */

/*
 * usb_function_stm32f407_ungate_clock
 * @usb_device: USB function device instance.
 * Activate USB core clock.
 */
void usb_function_stm32f407_ungate_clock(USB_STM32F407_HANDLE *usb_device)
{
    USB_STM32F407_DSTS      dsts;
    USB_STM32F407_PCGCCTL   power;

    /* If we are low power device. */
    if(usb_device->cfg.low_power)
    {
        /* Get device configuration. */
        dsts.d32 = OS_READ_REG32(&usb_device->regs.DREGS->DSTS);

        /* If we are suspended. */
        if(dsts.b.suspsts == 1)
        {
            /* Un-gate USB core clock. */
            power.d32 = OS_READ_REG32(&usb_device->regs.PCGCCTL);
            power.b.gatehclk = 0;
            power.b.stoppclk = 0;
            OS_WRITE_REG32(usb_device->regs.PCGCCTL, power.d32);

        }
    }

} /* usb_function_stm32f407_ungate_clock */

/*
 * usb_function_stm32f407_stop_device
 * @usb_device: USB function device instance.
 * Stop a USB device instance.
 */
void usb_function_stm32f407_stop_device(USB_STM32F407_HANDLE *usb_device)
{
    uint32_t i;

    /* Update device status. */
    usb_device->device.status = 1;

    /* Deinitialize all endpoints. */
    for (i = 0; i < usb_device->cfg.dev_endpoints ; i++)
    {
        OS_WRITE_REG32(&usb_device->regs.INEP_REGS[i]->DIEPINT, 0xFF);
        OS_WRITE_REG32(&usb_device->regs.OUTEP_REGS[i]->DOEPINT, 0xFF);
    }

    /* Deinitialize the device configuration. */
    OS_WRITE_REG32(&usb_device->regs.DREGS->DIEPMSK, 0);
    OS_WRITE_REG32(&usb_device->regs.DREGS->DOEPMSK, 0);
    OS_WRITE_REG32(&usb_device->regs.DREGS->DAINTMSK, 0);
    OS_WRITE_REG32(&usb_device->regs.DREGS->DAINT, 0xFFFFFFFF);

    /* Flush the FIFOs. */
    usb_stm32f407_flush_rx_fifo(usb_device);
    usb_stm32f407_flush_tx_fifo(usb_device, 0x10);

} /* usb_function_stm32f407_stop_device */

/*
 * usb_function_stm32f407_init
 * @usb_device: USB function device instance.
 * This function will initialize USB function interrupts.
 */
uint32_t usb_function_stm32f407_enable_interrupts(USB_STM32F407_HANDLE *usb_device)
{
    USB_STM32F407_GINTMSK  intmsk;

    intmsk.d32 = 0;

    /* Disable all interrupts. */
    OS_WRITE_REG32(&usb_device->regs.GREGS->GINTMSK, 0);

    /* Enable the common USB interrupts. */
    usb_stm32f407_enable_common_interrupt(usb_device);

    /* If we are using DMA. */
    if (usb_device->cfg.dma_enable == 0)
    {
        intmsk.b.rxstsqlvl = 1;
    }

    /* Enable device mode interrupts. */
    intmsk.b.usbsuspend = 1;
    intmsk.b.usbreset   = 1;
    intmsk.b.enumdone   = 1;
    intmsk.b.inepintr   = 1;
    intmsk.b.outepintr  = 1;
    intmsk.b.sofintr    = 1;
    intmsk.b.incomplisoin   = 1;
    intmsk.b.incomplisoout  = 1;

#ifdef STM32F407_USB_VBUS_SENSING_ENABLED
    intmsk.b.sessreqintr    = 1;
    intmsk.b.otgintr        = 1;
#endif

    /* Update interrupt configuration. */
    OS_MASK_REG32( &usb_device->regs.GREGS->GINTMSK, intmsk.d32, intmsk.d32);

    /* Always return success. */
    return (SUCCESS);

} /* usb_function_stm32f407_enable_interrupts */

/*
 * usb_function_stm32f407_connect
 * @usb_device: USB device instance.
 * This will connect the USB device on the USB bus.
 */
void usb_function_stm32f407_connect(USB_STM32F407_HANDLE *usb_device)
{
#ifndef STM32F407_USB_OTG_MODE
    USB_STM32F407_DCTL dctl;

    /* Get current configuration. */
    dctl.d32 = OS_READ_REG32(&usb_device->regs.DREGS->DCTL);

    /* Update configuration. */
    dctl.b.sftdiscon = 0;

    /* Connect the device on USB bus. */
    OS_WRITE_REG32(&usb_device->regs.DREGS->DCTL, dctl.d32);
#endif

} /* usb_function_stm32f407_connect */

/*
 * usb_function_stm32f407_disconnect
 * @usb_device: USB device instance.
 * This will disconnect the USB device from USB bus.
 */
void usb_function_stm32f407_disconnect(USB_STM32F407_HANDLE *usb_device)
{
#ifndef STM32F407_USB_OTG_MODE
    USB_STM32F407_DCTL  dctl;

    /* Get current configuration. */
    dctl.d32 = OS_READ_REG32(&usb_device->regs.DREGS->DCTL);

    /* Update configuration. */
    dctl.b.sftdiscon = 1;

    /* Disconnect this device from USB bus. */
    OS_WRITE_REG32(&usb_device->regs.DREGS->DCTL, dctl.d32);
#endif

} /* usb_function_stm32f407_disconnect */

#endif /* USB_FUNCTION */
